Documents/ЗаказНаДоставку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказНаДоставку</Name>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
				<xr:Item>Document.ОтгрузкаТоваровКлиенту</xr:Item>
				<xr:Item>Document.ЗаказКлиента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Доставка</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыДоставки25</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаДоставкиОтправителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаДоставкиПолучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоставкаДоПеревозчика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаДоставкиПеревозчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоставкиПеревозчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДоставкиС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДоставкиПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыеУсловияПеревозки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыеУсловияПеревозкиОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>В базовых ЕИ</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Распоряжение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаДоставку25</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтрокиДоставки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СпособыДоставки25.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыДоставки25</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашимиСилами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СиламиПеревозчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашКурьер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпределяетСлужбаДоставки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/НаправленияДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>НаправленияДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СкладПартнер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПланированияДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыПланированияДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТекущимДокументом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтдельнымДокументом</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыУказанияДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыУказанияДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаВесьДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСтрокам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказНаДоставку/Ext/ObjectModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнятьТочкиЗоныПоУмолчанию = Истина;
	ОбновитьДополнительныеПараметры = Ложь;
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
		Если ДанныеЗаполнения.Свойство("АдресТаблицаТовары") Тогда
			
			ТаблицаТовары = ПолучитьИзВременногоХранилища(ДанныеЗаполнения.АдресТаблицаТовары); // ТаблицаЗначений
			Товары.Загрузить(ТаблицаТовары);
			
		КонецЕсли;
		
		ЗаполнятьТочкиЗоныПоУмолчанию = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДанныеЗаполнения, "ЗаполнятьТочкиЗоныПоУмолчанию", Истина);
		ОбновитьДополнительныеПараметры = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДанныеЗаполнения, "ОбновитьДополнительныеПараметры", Ложь);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ОтгрузкаТоваровКлиенту") Тогда
		
		ЗаполнитьНаОснованииОтгрузкиКлиенту(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		ЗаполнитьНаОснованииРТиУ(ДанныеЗаполнения);
	
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		ЗаполнитьНаОснованииЗаказаКлиента(ДанныеЗаполнения);
		
	КонецЕсли;
	
	ИнициализироватьДокумент(ЗаполнятьТочкиЗоныПоУмолчанию, ОбновитьДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив; // Массив Из Строка
	
	Если СпособДоставки <> Перечисления.СпособыДоставки25.СиламиПеревозчика
	   И НЕ ДоставкаДоПеревозчика Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("Перевозчик");
		
	КонецЕсли;
	
	Если ДоставкаДоПеревозчика Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ЗонаДоставки");
		
	Иначе
		
		МассивНепроверяемыхРеквизитов.Добавить("ТочкаДоставкиПеревозчика");
		МассивНепроверяемыхРеквизитов.Добавить("ЗонаДоставкиПеревозчика");
		
	КонецЕсли;
	
	Если СпособДоставки = Перечисления.СпособыДоставки25.Самовывоз Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ТочкаДоставкиОтправителя");
		МассивНепроверяемыхРеквизитов.Добавить("ЗонаОтправления");
		
		МассивНепроверяемыхРеквизитов.Добавить("ТочкаДоставкиПолучателя");
		МассивНепроверяемыхРеквизитов.Добавить("ЗонаДоставки");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаОтгрузки)
	   И ДатаОтгрузки < НачалоДня(Дата) Тогда
		
		ШаблонСообщения = НСтр("ru = 'Дата отгрузки должна быть не меньше даты документа %1'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСообщения,
			Формат(Дата, "ДЛФ=DD"));
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Объект.ДатаОтгрузки",, Отказ);
		
	КонецЕсли;
	
	Если Получатель = Перевозчик
		И НЕ Получатель.Пустая()
		И (СпособДоставки = Перечисления.СпособыДоставки25.СиламиПеревозчика
			ИЛИ ДоставкаДоПеревозчика) Тогда
		
		ШаблонСообщения = НСтр("ru = 'Совпадают данные получателя и перевозчика (%1), оформление доставки невозможно.'");
			
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСообщения,
			Строка(Получатель));
		
		ОбщегоНазначения.СообщитьПользователю(
			ТекстСообщения,
			ЭтотОбъект,
			"Перевозчик",
			,
			Отказ);
		
	КонецЕсли;
	
	ПараметрыПроверкиКоличества = НоменклатураСервер.ПараметрыПроверкиЗаполненияКоличества();
	НоменклатураСервер.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ, ПараметрыПроверкиКоличества);
	
	НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если СпособДоставки <> Перечисления.СпособыДоставки25.НашимиСилами Тогда
		
		ДоставкаДоПеревозчика = Ложь;
		
	КонецЕсли;
	
	Если СпособДоставки <> Перечисления.СпособыДоставки25.СиламиПеревозчика
	   И Не ДоставкаДоПеревозчика Тогда
		
		Перевозчик = Справочники.Партнеры.ПустаяСсылка();
		
	КонецЕсли;
	
	Если Не ОсобыеУсловияПеревозки Тогда
		ОсобыеУсловияПеревозкиОписание = "";
	КонецЕсли;
	
	Если Не ДоставкаДоПеревозчика
		Или Не ЗначениеЗаполнено(Перевозчик) Тогда
		
		ТочкаДоставкиПеревозчика = Справочники.ТочкиДоставки.ПустаяСсылка();
		ЗонаДоставкиПеревозчика = Справочники.ЗоныДоставки.ПустаяСсылка();
		
	КонецЕсли;
	
	Если СпособДоставки = Перечисления.СпособыДоставки25.Самовывоз Тогда
		
		ТочкаДоставкиОтправителя = Справочники.ТочкиДоставки.ПустаяСсылка();
		ЗонаОтправления = Справочники.ЗоныДоставки.ПустаяСсылка();
		
		ТочкаДоставкиПолучателя = Справочники.ТочкиДоставки.ПустаяСсылка();
		ЗонаДоставки = Справочники.ЗоныДоставки.ПустаяСсылка();
		
	КонецЕсли;
	
	СтрокиТоваровИзменениеТолькоУпаковки = СтрокиТоваровИзменениеТолькоУпаковки();
	ДополнительныеСвойства.Вставить("СтрокиТоваровИзменениеТолькоУпаковки", СтрокиТоваровИзменениеТолькоУпаковки);
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДокумент(ЗаполнятьТочкиЗоныПоУмолчанию, ОбновитьДополнительныеПараметры)
	
	Ответственный = Пользователи.ТекущийПользователь();
	Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	НаправлениеДоставки = Перечисления.НаправленияДоставки.СкладПартнер;
	ЗаполненыДанныеТочкиОтправителя = Ложь;
	
	Если НЕ ЗначениеЗаполнено(ТочкаДоставкиОтправителя)
	   И ЗаполнятьТочкиЗоныПоУмолчанию Тогда
		
		ДанныеТочкиОтправителя = Справочники.ТочкиДоставки.СведенияТочкиДоставкиОсновная(Отправитель);
		ТочкаДоставкиОтправителя = ДанныеТочкиОтправителя.ТочкаДоставки;
		ЗонаОтправления = ДанныеТочкиОтправителя.ЗонаДоставки;
		ЗаполненыДанныеТочкиОтправителя = Истина;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЗонаОтправления)
	   И ЗначениеЗаполнено(ТочкаДоставкиОтправителя)
	   И НЕ ЗаполненыДанныеТочкиОтправителя
	   И ЗаполнятьТочкиЗоныПоУмолчанию Тогда
		
		РеквизитыТочкиОтправления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТочкаДоставкиОтправителя, "ЗонаДоставки");
		ЗонаОтправления = РеквизитыТочкиОтправления.ЗонаДоставки;
		
	КонецЕсли;
	
	Если ТочкаДоставкиПолучателя.Пустая()
	   И ЗаполнятьТочкиЗоныПоУмолчанию Тогда
		
		ДанныеТочкиПолучателя = Справочники.ТочкиДоставки.СведенияТочкиДоставкиОсновная(Получатель);
		ТочкаДоставкиПолучателя = ДанныеТочкиПолучателя.ТочкаДоставки;
		
		Если ЗонаДоставки.Пустая() Тогда
			
			ЗонаДоставки = ДанныеТочкиПолучателя.ЗонаДоставки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СпособДоставки <> Перечисления.СпособыДоставки25.НашимиСилами Тогда
		
		ДоставкаДоПеревозчика = Ложь;
		
	КонецЕсли;
	
	Если ДоставкаДоПеревозчика Тогда
		
		Если ТочкаДоставкиПеревозчика.Пустая()
		   И ЗаполнятьТочкиЗоныПоУмолчанию Тогда
			
			ДанныеТочкиПеревозчика = Справочники.ТочкиДоставки.СведенияТочкиДоставкиОсновная(Перевозчик);
			ТочкаДоставкиПеревозчика = ДанныеТочкиПеревозчика.ТочкаДоставки;
			
			Если ЗонаДоставки.Пустая() Тогда
			
				ЗонаДоставки = ДанныеТочкиПеревозчика.ЗонаДоставки;
			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбновитьДополнительныеПараметры Тогда
		
		Документы.ЗаказНаДоставку.ОбновитьДополнительныеПараметры(ЭтотОбъект, Товары);
		
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ДанныеЗаполнения - ДокументСсылка.РеализацияТоваровУслуг
//
Процедура ЗаполнитьНаОснованииРТиУ(ДанныеЗаполнения)
	
	ТекстЗапросаШапка =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.РеализацияПоЗаказам КАК РеализацияПоЗаказам,
	|	РеализацияТоваровУслуг.ТребуетсяДоставка КАК ТребуетсяДоставка,
	|	РеализацияТоваровУслуг.Склад.ЭтоГруппа КАК ГруппаСкладов,
	|	РеализацияТоваровУслуг.ВидПланированияДоставки КАК ВидПланированияДоставки,
	|	РеализацияТоваровУслуг.Склад КАК Отправитель,
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	РеализацияТоваровУслуг.СпособДоставки25 КАК СпособДоставки,
	|	РеализацияТоваровУслуг.Партнер КАК Получатель,
	|	РеализацияТоваровУслуг.ТочкаДоставки КАК ТочкаДоставкиПолучателя,
	|	РеализацияТоваровУслуг.ЗонаДоставки КАК ЗонаДоставки,
	|	РеализацияТоваровУслуг.ДоставкаДоПеревозчика КАК ДоставкаДоПеревозчика,
	|	РеализацияТоваровУслуг.ТочкаДоставкиПеревозчика КАК ТочкаДоставкиПеревозчика,
	|	РеализацияТоваровУслуг.ЗонаДоставкиПеревозчика КАК ЗонаДоставкиПеревозчика,
	|	РеализацияТоваровУслуг.ПеревозчикПартнер КАК Перевозчик,
	|	РеализацияТоваровУслуг.ВремяДоставкиС КАК ВремяДоставкиС,
	|	РеализацияТоваровУслуг.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	РеализацияТоваровУслуг.Дата КАК ДатаОтгрузки,
	|	РеализацияТоваровУслуг.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформация,
	|	РеализацияТоваровУслуг.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	РеализацияТоваровУслуг.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияСведенияСкладов.ТочкаСклада КАК ТочкаДоставкиОтправителя,
	|	РеализацияСведенияСкладов.ЗонаСклада КАК ЗонаОтправления
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.СкладыСведенияДоставки КАК РеализацияСведенияСкладов
	|ГДЕ
	|	РеализацияСведенияСкладов.Ссылка = &Ссылка
	|	И РеализацияСведенияСкладов.Склад = РеализацияСведенияСкладов.Ссылка.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоставкаОбороты.Номенклатура КАК Номенклатура,
	|	ДоставкаОбороты.Характеристика КАК Характеристика,
	|	ДоставкаОбороты.Серия КАК Серия,
	|	ДоставкаОбороты.Распоряжение КАК Распоряжение,
	|	ДоставкаОбороты.КодСтроки КАК КодСтрокиДоставки,
	|	ДоставкаОбороты.Упаковка КАК Упаковка,
	|	(ДоставкаОбороты.КДоставкеОборот - ДоставкаОбороты.КРейсуОборот) КАК Количество
	|ИЗ
	|	РегистрНакопления.Доставка.Обороты(
	|			,
	|			,
	|			,
	|			Распоряжение = &Ссылка
	|				И Плечо = 1) КАК ДоставкаОбороты
	|ГДЕ
	|	(ДоставкаОбороты.КДоставкеОборот - ДоставкаОбороты.КРейсуОборот) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодСтрокиДоставки";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаШапка;
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	РезультатШапка = РезультатыЗапроса[0];
	РезультатОтправитель = РезультатыЗапроса[1];
	РезультатТовары = РезультатыЗапроса[2];
	
	Отказ = Ложь;
	
	ВыборкаШапка = РезультатШапка.Выбрать();
	ВыборкаШапка.Следующий();
	
	ШаблонСообщения = "";
	
	Если ВыборкаШапка.ГруппаСкладов Тогда
		
		ШаблонСообщения = НСтр("ru = 'В документе %1 указана группа складов. Ввод на основании запрещен.'");
		Отказ = Истина;
		
	ИначеЕсли ВыборкаШапка.РеализацияПоЗаказам
			И ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента") Тогда 
		
		ШаблонСообщения = НСтр("ru = 'Документ %1 оформлен по распоряжениям. Ввод на основании запрещен.'");
		Отказ = Истина;
		
	ИначеЕсли НЕ ВыборкаШапка.ТребуетсяДоставка Тогда 
		
		ШаблонСообщения = НСтр("ru = 'В документе %1 не установлен признак ""Требуется доставка"". Ввод на основании запрещен.'");
		Отказ = Истина;
		
	ИначеЕсли ВыборкаШапка.ВидПланированияДоставки <> Перечисления.ВидыПланированияДоставки.ОтдельнымДокументом Тогда 
		
		ШаблонСообщения = НСтр("ru = 'Документ %1 не предусматривает планирование доставки отдельным документом. Ввод на основании запрещен.'");
		Отказ = Истина;
		
	КонецЕсли;
	
	Если Отказ Тогда
		
		ОснованиеСтрокой = ОбщегоНазначения.ПредметСтрокой(ДанныеЗаполнения);
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, ОснованиеСтрокой);
		
		ВызватьИсключение ТекстСообщения;
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаШапка);
	НаправлениеДоставки = Перечисления.НаправленияДоставки.СкладПартнер;
	
	ВыборкаОтправитель = РезультатОтправитель.Выбрать();
	Если ВыборкаОтправитель.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаОтправитель);
		
	КонецЕсли;
	
	ВыборкаТовары = РезультатТовары.Выбрать();
	Пока ВыборкаТовары.Следующий() Цикл
		
		СтрокаТовары = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТовары, ВыборкаТовары);
		
	КонецЦикла;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковок");
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Товары, СтруктураДействий);
	
КонецПроцедуры

// Параметры:
//  ДанныеЗаполнения - ДокументСсылка.ОтгрузкаТоваровКлиенту
//
Процедура ЗаполнитьНаОснованииОтгрузкиКлиенту(ДанныеЗаполнения)
	
	ЕстьИсправление = ИсправлениеДокументов.ЕстьИсправлениеИлиСторно(ДанныеЗаполнения);
	Если ЕстьИсправление Тогда
		
		ШаблонСообщения = НСтр("ru = 'На основании %1 уже введен исправительный документ.
			|Заказ на доставку может быть введен только на основании последнего исправительного документа.'");
		
		Отказ = Истина;
		
	Иначе
		
		ДанныеШапки = ДанныеШапкиДокументаОтгрузки(ДанныеЗаполнения);
		
		РезультатПроверки = ВозможностьВводаНаОснованииОтгрузкиКлиенту(ДанныеШапки);
		
		ШаблонСообщения = РезультатПроверки.ШаблонСообщения;
		Отказ = РезультатПроверки.Отказ;
		
	КонецЕсли;
	
	Если Отказ Тогда
		
		ОснованиеСтрокой = ОбщегоНазначения.ПредметСтрокой(ДанныеЗаполнения);
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, ОснованиеСтрокой);
		
		ВызватьИсключение ТекстСообщения;
		
	КонецЕсли;
	
	Если ДанныеШапки.Исправление Тогда
		
		ИсправляемыйДокумент = ДанныеШапки.ИсправляемыйДокумент;
		
	Иначе
		
		ИсправляемыйДокумент = ДанныеЗаполнения;
		
	КонецЕсли;
		
	ТекстЗапроса = ТекстЗапросаЗаполненияПоОтгрузкеКлиенту();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТекущийДокумент", ДанныеЗаполнения);
	Запрос.УстановитьПараметр("ИсправляемыйДокумент", ИсправляемыйДокумент);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	РезультатОтправитель = РезультатыЗапроса[0];
	РезультатТовары = РезультатыЗапроса[1];
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеШапки);
	НаправлениеДоставки = Перечисления.НаправленияДоставки.СкладПартнер;
	
	ВыборкаОтправитель = РезультатОтправитель.Выбрать();
	Если ВыборкаОтправитель.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаОтправитель);
		
	КонецЕсли;
	
	ВыборкаТовары = РезультатТовары.Выбрать();
	Пока ВыборкаТовары.Следующий() Цикл
		
		СтрокаТовары = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТовары, ВыборкаТовары);
		
	КонецЦикла;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковок");
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Товары, СтруктураДействий);
	
КонецПроцедуры

Функция ТекстЗапросаЗаполненияПоОтгрузкеКлиенту()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ОтгрузкаСведенияСкладов.ТочкаСклада КАК ТочкаДоставкиОтправителя,
	|	ОтгрузкаСведенияСкладов.ЗонаСклада КАК ЗонаОтправления
	|ИЗ
	|	Документ.ОтгрузкаТоваровКлиенту.СкладыСведенияДоставки КАК ОтгрузкаСведенияСкладов
	|ГДЕ
	|	ОтгрузкаСведенияСкладов.Ссылка = &ТекущийДокумент
	|	И ОтгрузкаСведенияСкладов.Склад = ОтгрузкаСведенияСкладов.Ссылка.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоставкаОбороты.Номенклатура КАК Номенклатура,
	|	ДоставкаОбороты.Характеристика КАК Характеристика,
	|	ДоставкаОбороты.Серия КАК Серия,
	|	ДоставкаОбороты.Распоряжение КАК Распоряжение,
	|	ДоставкаОбороты.КодСтроки КАК КодСтрокиДоставки,
	|	ДоставкаОбороты.Упаковка КАК Упаковка,
	|	(ДоставкаОбороты.КДоставкеОборот - ДоставкаОбороты.КРейсуОборот) КАК Количество
	|ИЗ
	|	РегистрНакопления.Доставка.Обороты(
	|			,
	|			,
	|			,
	|			Распоряжение = &ИсправляемыйДокумент
	|				И Плечо = 1) КАК ДоставкаОбороты
	|ГДЕ
	|	(ДоставкаОбороты.КДоставкеОборот - ДоставкаОбороты.КРейсуОборот) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодСтрокиДоставки";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Параметры:
//   ДокументОтгрузки - ДокументСсылка.ОтгрузкаТоваровКлиенту -
//
// Возвращаемое значение:
//   ВыборкаИзРезультатаЗапроса:
//     * ОтгрузкаПоЗаказам - Булево -
//     * ЗаказКакСчет - Булево -
//     * Исправление - Булево -
//     * ИсправляемыйДокумент - ДокументСсылка.ОтгрузкаТоваровКлиенту -
//     * ТребуетсяДоставка - Булево -
//     * ГруппаСкладов - Булево -
//     * ВидПланированияДоставки - ПеречислениеСсылка.ВидыПланированияДоставки -
//     * Отправитель - СправочникСсылка.Склады -
//     * Организация - СправочникСсылка.Организации -
//     * СпособДоставки - ПеречислениеСсылка.СпособыДоставки -
//     * Получатель - СправочникСсылка.Партнеры -
//     * ТочкаДоставкиПолучателя - СправочникСсылка.ТочкиДоставки -
//     * ЗонаДоставки - СправочникСсылка.ЗоныДоставки -
//     * ДоставкаДоПеревозчика - Булево -
//     * ТочкаДоставкиПеревозчика - СправочникСсылка.ТочкиДоставки -
//     * ЗонаДоставкиПеревозчика - СправочникСсылка.ЗоныДоставки -
//     * Перевозчик - СправочникСсылка.Партнеры -
//     * ВремяДоставкиС - Дата -
//     * ВремяДоставкиПо - Дата -
//     * ДатаОтгрузки - Дата -
//     * ДополнительнаяИнформация - Строка -
//     * ОсобыеУсловияПеревозки - Булево -
//     * ОсобыеУсловияПеревозкиОписание - Строка -
//
Функция ДанныеШапкиДокументаОтгрузки(ДокументОтгрузки)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ОтгрузкаТоваровКлиенту.ОтгрузкаПоЗаказам КАК ОтгрузкаПоЗаказам,
	|	ВЫБОР
	|		КОГДА ОтгрузкаТоваровКлиенту.ОтгрузкаПоЗаказам
	|			ТОГДА ВЫБОР
	|				КОГДА ОтгрузкаТоваровКлиенту.ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
	|					ТОГДА ВЫРАЗИТЬ(ОтгрузкаТоваровКлиенту.ЗаказКлиента КАК Документ.ЗаказКлиента).ЭтоЗаказКакСчет
	|				КОГДА ОтгрузкаТоваровКлиенту.ЗаказКлиента ССЫЛКА Документ.ЗаявкаНаВозвратТоваровОтКлиента
	|					ТОГДА ВЫРАЗИТЬ(ОтгрузкаТоваровКлиенту.ЗаказКлиента КАК Документ.ЗаявкаНаВозвратТоваровОтКлиента).ЭтоЗаказКакСчет
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗаказКакСчет,
	|	ОтгрузкаТоваровКлиенту.Исправление КАК Исправление,
	|	ОтгрузкаТоваровКлиенту.ИсправляемыйДокумент КАК ИсправляемыйДокумент,
	|	ОтгрузкаТоваровКлиенту.ТребуетсяДоставка КАК ТребуетсяДоставка,
	|	ОтгрузкаТоваровКлиенту.Склад.ЭтоГруппа КАК ГруппаСкладов,
	|	ОтгрузкаТоваровКлиенту.ВидПланированияДоставки КАК ВидПланированияДоставки,
	|	ОтгрузкаТоваровКлиенту.Склад КАК Отправитель,
	|	ОтгрузкаТоваровКлиенту.Организация КАК Организация,
	|	ОтгрузкаТоваровКлиенту.СпособДоставки25 КАК СпособДоставки,
	|	ОтгрузкаТоваровКлиенту.Партнер КАК Получатель,
	|	ОтгрузкаТоваровКлиенту.ТочкаДоставки КАК ТочкаДоставкиПолучателя,
	|	ОтгрузкаТоваровКлиенту.ЗонаДоставки КАК ЗонаДоставки,
	|	ОтгрузкаТоваровКлиенту.ДоставкаДоПеревозчика КАК ДоставкаДоПеревозчика,
	|	ОтгрузкаТоваровКлиенту.ТочкаДоставкиПеревозчика КАК ТочкаДоставкиПеревозчика,
	|	ОтгрузкаТоваровКлиенту.ЗонаДоставкиПеревозчика КАК ЗонаДоставкиПеревозчика,
	|	ОтгрузкаТоваровКлиенту.ПеревозчикПартнер КАК Перевозчик,
	|	ОтгрузкаТоваровКлиенту.ВремяДоставкиС КАК ВремяДоставкиС,
	|	ОтгрузкаТоваровКлиенту.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	ОтгрузкаТоваровКлиенту.Дата КАК ДатаОтгрузки,
	|	ОтгрузкаТоваровКлиенту.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформация,
	|	ОтгрузкаТоваровКлиенту.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ОтгрузкаТоваровКлиенту.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание
	|ИЗ
	|	Документ.ОтгрузкаТоваровКлиенту КАК ОтгрузкаТоваровКлиенту
	|ГДЕ
	|	ОтгрузкаТоваровКлиенту.Ссылка = &ДокументОтгрузки";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ДокументОтгрузки", ДокументОтгрузки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка;
	
КонецФункции

Функция ВозможностьВводаНаОснованииОтгрузкиКлиенту(ДанныеШапки)
	
	Результат = Новый Структура;
	Результат.Вставить("Отказ", Ложь);
	Результат.Вставить("ШаблонСообщения", "");
	
	Если ДанныеШапки.ГруппаСкладов Тогда
		
		Результат.ШаблонСообщения = НСтр("ru = 'В документе %1 указана группа складов. Ввод на основании запрещен.'");
		Результат.Отказ = Истина;
		
	ИначеЕсли ДанныеШапки.ОтгрузкаПоЗаказам 
			И НЕ ДанныеШапки.ЗаказКакСчет Тогда 
		
		Результат.ШаблонСообщения = НСтр("ru = 'Документ %1 оформлен по распоряжениям. Ввод на основании запрещен.'");
		Результат.Отказ = Истина;
		
	ИначеЕсли НЕ ДанныеШапки.ТребуетсяДоставка Тогда 
		
		Результат.ШаблонСообщения = НСтр("ru = 'В документе %1 не установлен признак ""Требуется доставка"". Ввод на основании запрещен.'");
		Результат.Отказ = Истина;
		
	ИначеЕсли ДанныеШапки.ВидПланированияДоставки <> Перечисления.ВидыПланированияДоставки.ОтдельнымДокументом Тогда 
		
		Результат.ШаблонСообщения = НСтр("ru = 'Документ %1 не предусматривает планирование доставки отдельным документом. Ввод на основании запрещен.'");
		Результат.Отказ = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ДанныеЗаполнения - ДокументСсылка.ЗаказКлиента
//
Процедура ЗаполнитьНаОснованииЗаказаКлиента(ДанныеЗаполнения)
	
	ТекстЗапроса = ТекстЗапросаЗаполненияПоЗаказуКлиента();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	РезультатШапка = РезультатыЗапроса[0];
	РезультатОтправитель = РезультатыЗапроса[1];
	РезультатТовары = РезультатыЗапроса[2];
	РезультатДатаОтгрузки = РезультатыЗапроса[3];
	
	Отказ = Ложь;
	
	ВыборкаШапка = РезультатШапка.Выбрать();
	ВыборкаШапка.Следующий();
	
	ШаблонСообщения = "";
	
	Если ВыборкаШапка.ГруппаСкладов Тогда
		
		ШаблонСообщения = НСтр("ru = 'В документе %1 указана группа складов. Ввод на основании запрещен.'");
		Отказ = Истина;
		
	ИначеЕсли ВыборкаШапка.СпособУказанияДоставки = Перечисления.СпособыУказанияДоставки.ПоСтрокам Тогда 
		
		ШаблонСообщения = НСтр("ru = 'В документе %1 доставка настраивается построчно. Ввод на основании запрещен.'");
		Отказ = Истина;
		
	ИначеЕсли НЕ ВыборкаШапка.ТребуетсяДоставка Тогда 
		
		ШаблонСообщения = НСтр("ru = 'В документе %1 не установлен признак ""Требуется доставка"". Ввод на основании запрещен.'");
		Отказ = Истина;
		
	ИначеЕсли ВыборкаШапка.ВидПланированияДоставки <> Перечисления.ВидыПланированияДоставки.ОтдельнымДокументом Тогда 
		
		ШаблонСообщения = НСтр("ru = 'Документ %1 не предусматривает планирование доставки отдельным документом. Ввод на основании запрещен.'");
		Отказ = Истина;
		
	КонецЕсли;
	
	Если Отказ Тогда
		
		ОснованиеСтрокой = ОбщегоНазначения.ПредметСтрокой(ДанныеЗаполнения);
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, ОснованиеСтрокой);
		
		ВызватьИсключение ТекстСообщения;
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаШапка);
	НаправлениеДоставки = Перечисления.НаправленияДоставки.СкладПартнер;
	
	ВыборкаОтправитель = РезультатОтправитель.Выбрать();
	Если ВыборкаОтправитель.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаОтправитель);
		
	КонецЕсли;
	
	ВыборкаДатаОтгрузки = РезультатДатаОтгрузки.Выбрать();
	Если ВыборкаДатаОтгрузки.Количество() = 1
	   И ВыборкаДатаОтгрузки.Следующий() Тогда
		
		ДатаОтгрузки = ВыборкаДатаОтгрузки.ДатаОтгрузки;
		
	КонецЕсли;
	
	ВыборкаТовары = РезультатТовары.Выбрать();
	Пока ВыборкаТовары.Следующий() Цикл
		
		СтрокаТовары = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТовары, ВыборкаТовары);
		
	КонецЦикла;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковок");
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Товары, СтруктураДействий);
	
КонецПроцедуры

Функция ТекстЗапросаЗаполненияПоЗаказуКлиента()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗаказКлиента.ТребуетсяДоставка КАК ТребуетсяДоставка,
	|	ЗаказКлиента.Склад.ЭтоГруппа КАК ГруппаСкладов,
	|	ЗаказКлиента.ВидПланированияДоставки КАК ВидПланированияДоставки,
	|	ЗаказКлиента.СпособУказанияДоставки КАК СпособУказанияДоставки,
	|	ЗаказКлиента.Склад КАК Отправитель,
	|	ЗаказКлиента.Организация КАК Организация,
	|	ЗаказКлиента.СпособДоставки25 КАК СпособДоставки,
	|	ЗаказКлиента.Партнер КАК Получатель,
	|	ЗаказКлиента.ТочкаДоставки КАК ТочкаДоставкиПолучателя,
	|	ЗаказКлиента.ЗонаДоставки КАК ЗонаДоставки,
	|	ЗаказКлиента.ДоставкаДоПеревозчика КАК ДоставкаДоПеревозчика,
	|	ЗаказКлиента.ТочкаДоставкиПеревозчика КАК ТочкаДоставкиПеревозчика,
	|	ЗаказКлиента.ЗонаДоставкиПеревозчика КАК ЗонаДоставкиПеревозчика,
	|	ЗаказКлиента.ПеревозчикПартнер КАК Перевозчик,
	|	ЗаказКлиента.ВремяДоставкиС КАК ВремяДоставкиС,
	|	ЗаказКлиента.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	ЗаказКлиента.ДополнительнаяИнформацияПоДоставке КАК ДополнительнаяИнформация,
	|	ЗаказКлиента.ОсобыеУсловияПеревозки КАК ОсобыеУсловияПеревозки,
	|	ЗаказКлиента.ОсобыеУсловияПеревозкиОписание КАК ОсобыеУсловияПеревозкиОписание
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиентаСведенияСкладов.ТочкаСклада КАК ТочкаДоставкиОтправителя,
	|	ЗаказКлиентаСведенияСкладов.ЗонаСклада КАК ЗонаОтправления
	|ИЗ
	|	Документ.ЗаказКлиента.СкладыСведенияДоставки КАК ЗаказКлиентаСведенияСкладов
	|ГДЕ
	|	ЗаказКлиентаСведенияСкладов.Ссылка = &Ссылка
	|	И ЗаказКлиентаСведенияСкладов.Склад = ЗаказКлиентаСведенияСкладов.Ссылка.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоставкаОбороты.Номенклатура КАК Номенклатура,
	|	ДоставкаОбороты.Характеристика КАК Характеристика,
	|	ДоставкаОбороты.Серия КАК Серия,
	|	ДоставкаОбороты.Распоряжение КАК Распоряжение,
	|	ДоставкаОбороты.КодСтроки КАК КодСтрокиДоставки,
	|	ДоставкаОбороты.Упаковка КАК Упаковка,
	|	(ДоставкаОбороты.КДоставкеОборот - ДоставкаОбороты.КРейсуОборот) КАК Количество
	|ИЗ
	|	РегистрНакопления.Доставка.Обороты(
	|			,
	|			,
	|			,
	|			Распоряжение = &Ссылка
	|				И Плечо = 1) КАК ДоставкаОбороты
	|ГДЕ
	|	(ДоставкаОбороты.КДоставкеОборот - ДоставкаОбороты.КРейсуОборот) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодСтрокиДоставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 2
	|	ДоставкаОбороты.ДатаОтгрузки КАК ДатаОтгрузки
	|ИЗ
	|	РегистрНакопления.Доставка.Обороты(
	|			,
	|			,
	|			,
	|			Распоряжение = &Ссылка
	|				И Плечо = 1) КАК ДоставкаОбороты
	|ГДЕ
	|	(ДоставкаОбороты.КДоставкеОборот - ДоставкаОбороты.КРейсуОборот) > 0";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Возвращаемое значение:
//  ТаблицаЗначений - Строки товаров, по которым изменилась только упаковки или количество:
//   * Распоряжение - ОпределяемыйТип.РаспоряжениеНаДоставку25
//   * КодСтрокиДоставки - Число
//
Функция СтрокиТоваровИзменениеТолькоУпаковки()
	
	СтрокиТоваровИзменениеУпаковки = Новый ТаблицаЗначений();
	СтрокиТоваровИзменениеУпаковки.Колонки.Добавить("Распоряжение", Метаданные.ОпределяемыеТипы.РаспоряжениеНаДоставку25.тип);
	СтрокиТоваровИзменениеУпаковки.Колонки.Добавить("КодСтрокиДоставки", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0));
	
	Если НЕ ЭтоНовый() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказНаДоставкуТовары.Распоряжение КАК Распоряжение,
		|	ЗаказНаДоставкуТовары.КодСтрокиДоставки КАК КодСтрокиДоставки,
		|	ЗаказНаДоставкуТовары.Упаковка КАК Упаковка
		|ИЗ
		|	Документ.ЗаказНаДоставку.Товары КАК ЗаказНаДоставкуТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаДоставку КАК ЗаказНаДоставку
		|		ПО ЗаказНаДоставкуТовары.Ссылка = ЗаказНаДоставку.Ссылка
		|ГДЕ
		|	ЗаказНаДоставку.Ссылка = &Ссылка
		|	И ЗаказНаДоставку.ДатаОтгрузки = &ДатаОтгрузки
		|	И ЗаказНаДоставку.СпособДоставки = &СпособДоставки
		|	И ЗаказНаДоставку.Отправитель = &Отправитель
		|	И ЗаказНаДоставку.ТочкаДоставкиОтправителя = &ТочкаДоставкиОтправителя
		|	И ЗаказНаДоставку.ЗонаОтправления = &ЗонаОтправления
		|	И ЗаказНаДоставку.Получатель = &Получатель
		|	И ЗаказНаДоставку.ТочкаДоставкиПолучателя = &ТочкаДоставкиПолучателя
		|	И ЗаказНаДоставку.ЗонаДоставки = &ЗонаДоставки
		|	И ЗаказНаДоставку.ДоставкаДоПеревозчика = &ДоставкаДоПеревозчика
		|	И ЗаказНаДоставку.ТочкаДоставкиПеревозчика = &ТочкаДоставкиПеревозчика
		|	И ЗаказНаДоставку.Перевозчик = &Перевозчик
		|	И ЗаказНаДоставку.ЗонаДоставкиПеревозчика = &ЗонаДоставкиПеревозчика";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ДатаОтгрузки", ДатаОтгрузки);
		Запрос.УстановитьПараметр("СпособДоставки", СпособДоставки);
		Запрос.УстановитьПараметр("Отправитель", Отправитель);
		Запрос.УстановитьПараметр("ТочкаДоставкиОтправителя", ТочкаДоставкиОтправителя);
		Запрос.УстановитьПараметр("ЗонаОтправления", ЗонаОтправления);
		Запрос.УстановитьПараметр("Получатель", Получатель);
		Запрос.УстановитьПараметр("ТочкаДоставкиПолучателя", ТочкаДоставкиПолучателя);
		Запрос.УстановитьПараметр("ЗонаДоставки", ЗонаДоставки);
		Запрос.УстановитьПараметр("ДоставкаДоПеревозчика", ДоставкаДоПеревозчика);
		Запрос.УстановитьПараметр("ТочкаДоставкиПеревозчика", ТочкаДоставкиПеревозчика);
		Запрос.УстановитьПараметр("Перевозчик", Перевозчик);
		Запрос.УстановитьПараметр("ЗонаДоставкиПеревозчика", ЗонаДоставкиПеревозчика);
		
		ПредыдущиеСтроки = Запрос.Выполнить().Выгрузить();
		
		ОтборСтрок = Новый Структура;
		ОтборСтрок.Вставить("Распоряжение", Неопределено);
		ОтборСтрок.Вставить("КодСтрокиДоставки", 0);
		
		Для Каждого ПредыдущаяСтрока Из ПредыдущиеСтроки Цикл
			
			ЗаполнитьЗначенияСвойств(ОтборСтрок, ПредыдущаяСтрока);
			ТекущиеСтроки = Товары.НайтиСтроки(ОтборСтрок);
			Если ТекущиеСтроки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ТекущаяСтрока = ТекущиеСтроки[0];
			Если ТекущаяСтрока.Упаковка <> ПредыдущаяСтрока.Упаковка Тогда
				
				СтрокаИзменениеУпаковки = СтрокиТоваровИзменениеУпаковки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаИзменениеУпаковки, ТекущаяСтрока);
				
			КонецЕсли;
			
		КонецЦикла;
		
		СтрокиТоваровИзменениеУпаковки.Свернуть("Распоряжение, КодСтрокиДоставки");
		
	КонецЕсли;
	
	Возврат СтрокиТоваровИзменениеУпаковки;
	
КонецФункции

#КонецОбласти

#КонецЕсли
